# Code Samples From Large Group

Place your notes and code samples from large group here.

In [1]:
import pandas as pd

In [7]:
data = [
    {'name': 'abby', 'age': 3.5},
    {'name': 'bob', 'age': 3.0},
    {'name': 'chris', 'age': 2.5},
    {'name': 'della', 'age': 4.0},
]
students = pd.DataFrame(data)

In [13]:
students

    name  age
0   abby  3.5
1    bob  3.0
2  chris  2.5
3  della  4.0

In [15]:
students[0:1]

   name  age
0  abby  3.5

In [16]:
#bob and chris
students[1:3]

    name  age
1    bob  3.0
2  chris  2.5

In [19]:
students.iloc[1:3, 1:]

   age
1  3.0
2  2.5

In [20]:
students

    name  age
0   abby  3.5
1    bob  3.0
2  chris  2.5
3  della  4.0

In [22]:
for index, row in students.iterrows():
    print(f"At index {index}, student {row['name']} has a GPA of {row['age']}")

At index 0, student abby has a GPA of 3.5
At index 1, student bob has a GPA of 3.0
At index 2, student chris has a GPA of 2.5
At index 3, student della has a GPA of 4.0

In [23]:
# columns
students.columns

Index(['name', 'age'], dtype='object')

In [24]:
students.columns = ['name','gpa']

students

    name  gpa
0   abby  3.5
1    bob  3.0
2  chris  2.5
3  della  4.0

In [25]:
students['gpa'] > 3.2

0     True
1    False
2    False
3     True
Name: gpa, dtype: bool

In [26]:
filter = students['gpa'] > 3.2

In [27]:
students[filter]

    name  gpa
0   abby  3.5
3  della  4.0

In [28]:
smart_students = students[filter]

In [29]:
smart_students

    name  gpa
0   abby  3.5
3  della  4.0

In [30]:
# written out longhand:
smart_students = students[students['gpa'] > 3.2]
smart_students

    name  gpa
0   abby  3.5
3  della  4.0

In [31]:
places = pd.read_json("google-places.json")

In [34]:
places.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   geometry               20 non-null     object
 1   icon                   20 non-null     object
 2   icon_background_color  20 non-null     object
 3   icon_mask_base_uri     20 non-null     object
 4   name                   20 non-null     object
 5   photos                 16 non-null     object
 6   place_id               20 non-null     object
 7   reference              20 non-null     object
 8   scope                  20 non-null     object
 9   types                  20 non-null     object
 10  vicinity               20 non-null     object
 11  business_status        18 non-null     object
 12  opening_hours          10 non-null     object
 13  plus_code              18 non-null     object
 14  rating                 16 non-null     float64
 15  user_ratings_total     16 non-null     float64
 16  price_level            2 non-null      float64
dtypes: float64(3), object(14)
memory usage: 2.8+ KB

In [37]:
places[0:5][['name','types', 'opening_hours', 'rating']]

,name,types,opening_hours,rating
0,Syracuse,"[locality, political]",NaN,NaN
1,Crowne Plaza Syracuse,"[lodging, point_of_interest, establishment]",{'open_now': True},4.0
2,The Parkview Hotel,"[lodging, point_of_interest, establishment]",{'open_now': True},4.3
3,Jefferson Clinton Suites,"[lodging, point_of_interest, establishment]",{'open_now': True},4.4
4,Courtyard by Marriott Syracuse Downtown at Arm...,"[lodging, point_of_interest, establishment]",NaN,4.1

In [38]:
places.head(5)

,geometry,icon,icon_background_color,icon_mask_base_uri,name,photos,place_id,reference,scope,types,vicinity,business_status,opening_hours,plus_code,rating,user_ratings_total,price_level
0,"{'location': {'lat': 43.0481221, 'lng': -76.14...",https://maps.gstatic.com/mapfiles/place_api/ic...,#7B9EB0,https://maps.gstatic.com/mapfiles/place_api/ic...,Syracuse,"[{'height': 1080, 'html_attributions': ['<a hr...",ChIJDZqXv5vz2YkRRZWt1-IM1QA,ChIJDZqXv5vz2YkRRZWt1-IM1QA,GOOGLE,"[locality, political]",Syracuse,NaN,NaN,NaN,NaN,NaN,NaN
1,"{'location': {'lat': 43.0476078, 'lng': -76.14...",https://maps.gstatic.com/mapfiles/place_api/ic...,#909CE1,https://maps.gstatic.com/mapfiles/place_api/ic...,Crowne Plaza Syracuse,"[{'height': 2048, 'html_attributions': ['<a hr...",ChIJXxPu66Tz2YkRrDM-ZxvDhEE,ChIJXxPu66Tz2YkRrDM-ZxvDhEE,GOOGLE,"[lodging, point_of_interest, establishment]","701 East Genesee Street, Syracuse",OPERATIONAL,{'open_now': True},"{'compound_code': '2VX5+27 Syracuse, NY, USA',...",4.0,1172.0,NaN
2,"{'location': {'lat': 43.0476157, 'lng': -76.14...",https://maps.gstatic.com/mapfiles/place_api/ic...,#909CE1,https://maps.gstatic.com/mapfiles/place_api/ic...,The Parkview Hotel,"[{'height': 2584, 'html_attributions': ['<a hr...",ChIJrWsN9KTz2YkRFwo4vpFDe8I,ChIJrWsN9KTz2YkRFwo4vpFDe8I,GOOGLE,"[lodging, point_of_interest, establishment]","713 East Genesee Street, Syracuse",OPERATIONAL,{'open_now': True},"{'compound_code': '2VX5+2J Syracuse, NY, USA',...",4.3,356.0,NaN
3,"{'location': {'lat': 43.0472894, 'lng': -76.15...",https://maps.gstatic.com/mapfiles/place_api/ic...,#909CE1,https://maps.gstatic.com/mapfiles/place_api/ic...,Jefferson Clinton Suites,"[{'height': 3120, 'html_attributions': ['<a hr...",ChIJa_hOyrjz2YkRPNS3MsHdMlA,ChIJa_hOyrjz2YkRPNS3MsHdMlA,GOOGLE,"[lodging, point_of_interest, establishment]","416 South Clinton Street, Syracuse",OPERATIONAL,{'open_now': True},"{'compound_code': '2RWW+WF Syracuse, NY, USA',...",4.4,418.0,NaN
4,"{'location': {'lat': 43.0488846, 'lng': -76.15...",https://maps.gstatic.com/mapfiles/place_api/ic...,#909CE1,https://maps.gstatic.com/mapfiles/place_api/ic...,Courtyard by Marriott Syracuse Downtown at Arm...,"[{'height': 1192, 'html_attributions': ['<a hr...",ChIJGzEmOsfz2YkRmZJfIkMXpPo,ChIJGzEmOsfz2YkRmZJfIkMXpPo,GOOGLE,"[lodging, point_of_interest, establishment]","300 West Fayette Street, Syracuse",OPERATIONAL,NaN,"{'compound_code': '2RXV+HH Syracuse, NY, USA',...",4.1,414.0,NaN

In [39]:
places.tail(3)

,geometry,icon,icon_background_color,icon_mask_base_uri,name,photos,place_id,reference,scope,types,vicinity,business_status,opening_hours,plus_code,rating,user_ratings_total,price_level
17,"{'location': {'lat': 43.0501537, 'lng': -76.15...",https://maps.gstatic.com/mapfiles/place_api/ic...,#7B9EB0,https://maps.gstatic.com/mapfiles/place_api/ic...,United States Government: U.S. Attorney's Office,"[{'height': 256, 'html_attributions': ['<a hre...",ChIJqdnph7jz2YkRZPPfwIlotpM,ChIJqdnph7jz2YkRZPPfwIlotpM,GOOGLE,"[point_of_interest, establishment]","100 South Clinton Street #9000, Syracuse",OPERATIONAL,{'open_now': True},"{'compound_code': '3R2W+37 Syracuse, NY, USA',...",3.5,2.0,NaN
18,"{'location': {'lat': 43.0437854, 'lng': -76.14...",https://maps.gstatic.com/mapfiles/place_api/ic...,#7B9EB0,https://maps.gstatic.com/mapfiles/place_api/ic...,"Ran D Anbar, MD",NaN,ChIJHeCdOKLz2YkRwZSzcGc-rF8,ChIJHeCdOKLz2YkRwZSzcGc-rF8,GOOGLE,"[doctor, health, point_of_interest, establishm...","750 East Adams Street, Syracuse",OPERATIONAL,NaN,"{'compound_code': '2VV5+GC Syracuse, NY, USA',...",5.0,1.0,NaN
19,"{'location': {'lat': 43.03426049999999, 'lng':...",https://maps.gstatic.com/mapfiles/place_api/ic...,#7B9EB0,https://maps.gstatic.com/mapfiles/place_api/ic...,Eastside,"[{'height': 1816, 'html_attributions': ['<a hr...",ChIJlfyBL2jz2YkR7sjX7ltV1GY,ChIJlfyBL2jz2YkR7sjX7ltV1GY,GOOGLE,"[neighborhood, political]",Syracuse,NaN,NaN,NaN,NaN,NaN,NaN

In [42]:
places.sample(1)

,geometry,icon,icon_background_color,icon_mask_base_uri,name,photos,place_id,reference,scope,types,vicinity,business_status,opening_hours,plus_code,rating,user_ratings_total,price_level
0,"{'location': {'lat': 43.0481221, 'lng': -76.14...",https://maps.gstatic.com/mapfiles/place_api/ic...,#7B9EB0,https://maps.gstatic.com/mapfiles/place_api/ic...,Syracuse,"[{'height': 1080, 'html_attributions': ['<a hr...",ChIJDZqXv5vz2YkRRZWt1-IM1QA,ChIJDZqXv5vz2YkRRZWt1-IM1QA,GOOGLE,"[locality, political]",Syracuse,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
products = pd.read_csv("products.csv")

In [45]:
products

     name  price
0   apple   1.99
1    pear   2.99
2  orange   3.99
3    milk   1.59

In [47]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 10.1 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [48]:
prices = pd.read_excel("prices.xlsx")
prices

    name  price
0  pizza  10.99
1  juice   2.99
2  candy   4.99

In [49]:
exam_scores = pd.read_csv("https://raw.githubusercontent.com/mafudge/datasets/master/exam-scores/exam-scores.csv")
exam_scores

,Class_Section,Exam_Version,Completion_Time,Made_Own_Study_Guide,Did_Exam_Prep Assignment,Studied_In_Groups,Student_Score,Percentage,Letter_Grade
0,M01,A,20,N,N,Y,24,80.00%,B
1,M01,A,20,?,?,?,27,90.00%,A-
2,M01,A,30,Y,Y,Y,30,100.00%,A
3,M01,A,50,N,Y,Y,18,60.00%,C-
4,M01,A,55,Y,Y,N,24,80.00%,B
...,...,...,...,...,...,...,...,...,...
60,M02,D,40,?,?,?,23,76.70%,B-
61,M02,D,45,Y,Y,N,22,73.30%,C+
62,M02,D,45,?,?,?,24,80.00%,B
63,M02,D,55,Y,Y,N,24,80.00%,B
64,M02,D,60,N,N,Y,24,80.00%,B

In [51]:
animals = pd.read_json("https://data.austintexas.gov/resource/wter-evkm.json")
animals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   animal_id         1000 non-null   object
 1   name              701 non-null    object
 2   datetime          1000 non-null   datetime64[ns]
 3   datetime2         1000 non-null   object
 4   found_location    1000 non-null   object
 5   intake_type       1000 non-null   object
 6   intake_condition  1000 non-null   object
 7   animal_type       1000 non-null   object
 8   sex_upon_intake   1000 non-null   object
 9   age_upon_intake   1000 non-null   object
 10  breed             1000 non-null   object
 11  color             1000 non-null   object
dtypes: datetime64[ns](1), object(11)
memory usage: 93.9+ KB

In [56]:
animal_types = list(animals['animal_type'].unique())

In [57]:
animal_types

['Dog', 'Cat', 'Other', 'Bird']

In [59]:
from ipywidgets import interact_manual
from IPython.display import display

@interact_manual(animal_type=animal_types)
def onclick(animal_type):
    print(animal_type)
    filter = animals['animal_type'] == animal_type
    display(animals[filter])

interactive(children=(Dropdown(description='animal_type', options=('Dog', 'Cat', 'Other', 'Bird'), value='Dog'…

In [60]:
animals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   animal_id         1000 non-null   object
 1   name              701 non-null    object
 2   datetime          1000 non-null   datetime64[ns]
 3   datetime2         1000 non-null   object
 4   found_location    1000 non-null   object
 5   intake_type       1000 non-null   object
 6   intake_condition  1000 non-null   object
 7   animal_type       1000 non-null   object
 8   sex_upon_intake   1000 non-null   object
 9   age_upon_intake   1000 non-null   object
 10  breed             1000 non-null   object
 11  color             1000 non-null   object
dtypes: datetime64[ns](1), object(11)
memory usage: 93.9+ KB

In [64]:
animals['sex_upon_intake'].unique()

array(['Neutered Male', 'Spayed Female', 'Intact Male', 'Intact Female',
       'Unknown'], dtype=object)

In [65]:
animals['sex_upon_intake'].value_counts()

sex_upon_intake
Intact Female    329
Intact Male      299
Neutered Male    136
Spayed Female    133
Unknown          103
Name: count, dtype: int64

In [66]:
animals['sex_upon_intake'].value_counts(normalize=True)

sex_upon_intake
Intact Female    0.329
Intact Male      0.299
Neutered Male    0.136
Spayed Female    0.133
Unknown          0.103
Name: proportion, dtype: float64

In [67]:
sex = animals['sex_upon_intake'].value_counts(normalize=True)

In [69]:
sex['Spayed Female']

0.133

In [72]:
# loading in a webpage
standings = pd.read_html("https://en.wikipedia.org/wiki/Atlantic_Coast_Conference")

In [75]:
# you get back a python list of tables on the web page
standings[1]

,Institution,Location,Joined,Founded,Type,Enrollment,Endowment (millions),Nickname,Colors
0,Clemson University,"Clemson, South Carolina",1953,1889,Public (land-grant),25822,"$1,007[5]",Tigers,.mw-parser-output .legend{page-break-inside:av...
1,Duke University,"Durham, North Carolina",1953,1838,Private (non-sectarian) (Methodist-founded),16780,"$12,700[6]",Blue Devils,NaN
2,University of North Carolina at Chapel Hill,"Chapel Hill, North Carolina",1953,1789,Public,30101,"$5,160[7]",Tar Heels,NaN
3,North Carolina State University,"Raleigh, North Carolina",1953,1887,Public (land-grant),36304,"$1,950[8]",Wolfpack,NaN
4,Wake Forest University,"Winston-Salem, North Carolina",1953,1834,Private (non-sectarian) (Baptist-founded),8789,"$1,860[7]",Demon Deacons,NaN
5,University of Virginia,"Charlottesville, Virginia",1953,1819,Public,25018,"$9,800[9]",Cavaliers,NaN
6,Georgia Institute of Technology,"Atlanta, Georgia",1979[a],1885,Public,47961,"$2,970[7]",Yellow Jackets,NaN
7,Florida State University,"Tallahassee, Florida",1991[b],1851,Public,45493,$898[12],Seminoles,NaN
8,University of Miami,"Coral Gables, Florida",2004,1925,Private (non-sectarian),17811,"$1,340[13]",Hurricanes,NaN
9,Virginia Polytechnic Institute and State Unive...,"Blacksburg, Virginia",2004,1872,Public (land-grant),36383,"$1,340[14]",Hokies,NaN
10,Boston College,"Chestnut Hill, Massachusetts",2005,1863,Private (Jesuit),14890,"$3,300[15]",Eagles,NaN
11,University of Notre Dame,"Notre Dame, Indiana",2013,1842,Private (Holy Cross),12681,"$16,700[16]",Fighting Irish,NaN
12,University of Pittsburgh,"Pittsburgh, Pennsylvania",2013,1787,Public (state-related),"28,391[c]","$5,680[18]",Panthers,NaN
13,Syracuse University,"Syracuse, New York",2013,1870,Private (non-sectarian),21322,"$1,790[19]",Orange,NaN
14,University of Louisville,"Louisville, Kentucky",2014,1798,Public,21430,$884[20],Cardinals,NaN

In [76]:
students

    name  gpa
0   abby  3.5
1    bob  3.0
2  chris  2.5
3  della  4.0

In [77]:
students['major'] = "IMT"

In [80]:
def deanslist(gpa):
    if gpa > 3.2:
        return "Yes"
    else:
        return "No"
    
assert deanslist(3.4) == "Yes"

In [81]:
students['deans_list'] = students.apply(lambda row: deanslist(row['gpa']), axis=1)

In [82]:
students

    name  gpa major deans_list
0   abby  3.5   IMT        Yes
1    bob  3.0   IMT         No
2  chris  2.5   IMT         No
3  della  4.0   IMT        Yes